erp3l/src/Documents/ВерсияГрафикаЦеннойБумаги/ВерсияГрафикаЦеннойБумаги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВерсияГрафикаЦеннойБумаги</name>
  <registerRecords>InformationRegister.УдалитьГрафикиНоминалаЦенныхБумаг</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>InformationRegister.УдалитьВерсииНоминалаЦенныхБумаг</registerRecords>
  <registerRecords>InformationRegister.ВерсииРасчетов</registerRecords>
  <registerRecords>InformationRegister.УдалитьГрафикиРасчетов</registerRecords>
  <attributes>
    <name>ФинансовыйИнструмент</name>
    <type>
      <types>CatalogRef.ЦенныеБумаги</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьУплатыПроцентов</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтсчетаПроцентныхПериодов</name>
    <type>
      <types>EnumRef.ВидыДатОтсчетаПериодичности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПервогоПроцентногоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СдвигДатыУплатыПроцентов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаОтсчетаСдвигаДатыУплаты</name>
    <type>
      <types>EnumRef.СпособыОпределенияДатыОперацииПоПериоду</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПроцентнойСтавки</name>
    <type>
      <types>EnumRef.ТипыСтавокДляРасчетаПериодическихОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>РучноеУправлениеИзменениямиСтавки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентнаяСтавка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИндикативнаяСтавка</name>
    <type>
      <types>CatalogRef.ВидыКотировокФинансовыхИнструментов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлавающаяСтавкаМинимум</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлавающаяСтавкаМаксимум</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СдвигДатыФиксацииСтавки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаОтсчетаДатыФиксацииСтавки</name>
    <type>
      <types>EnumRef.СпособыОпределенияДатыОперацииПоПериоду</types>
    </type>
  </attributes>
  <attributes>
    <name>БазаДляРасчетаПроцентов</name>
    <type>
      <types>CatalogRef.СпособыРасчетаДнейПериодическихОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>ПереносДатСНерабочихДней</name>
    <type>
      <types>EnumRef.СпособыПереносаОперацийСНерабочегоДня</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзменяетсяДлительностьПроцентногоПериодаПриПереносе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственныйКалендарь</name>
    <type>
      <types>CatalogRef.ПроизводственныеКалендари</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыплачиватьПроцентыВДатыПогашенияТела</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыплачиватьПроцентыПериодически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимАктуализацииЗаявок</name>
    <type>
      <types>EnumRef.РежимыАктуализацииЗаявокПоГрафикам</types>
    </type>
  </attributes>
  <tabularSections>
    <name>График</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОсновнойДолгПолучение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОсновнойДолгВозврат</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОсновнойДолгОстаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентыНачислено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентыУплачено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентыОстаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПроцентныеСтавки</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФиксированнаяЧасть</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПлавающаяЧасть</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентнаяСтавка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Проценты</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентыНачислено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентыУплачено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаЗадолженности</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентнаяСтавка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ГрафикНоминалаЛинейный</name>
    <attributes>
      <name>ДатаОперации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КолонкаГрафика</name>
      <type>
        <types>EnumRef.КолонкиГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

erp3l/src/Documents/ВерсияГрафикаЦеннойБумаги/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт
	
	ПолноеИмяДокумента = ОбщегоНазначения.ИмяТаблицыПоСсылке(ДокументСсылка);
	ИмяДокумента = СтрРазделить(ПолноеИмяДокумента, ".")[1];
			
	ТаблицыДляДвижений = Новый Структура;		
	ДополнительныеСвойства = Новый Структура;
	НомераТаблиц = Новый Структура;
	
	
	Если Отказ Тогда
		Возврат ДополнительныеСвойства;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ТаблицыДляДвижений", ТаблицыДляДвижений);
	
	Возврат ДополнительныеСвойства;

КонецФункции

Процедура ЗаполнитьГрафикЛинейный(График, ГрафикЛинейный) Экспорт
	
	ГрафикЛинейный.Очистить();
	
	СписокКолонок = ПолучитьСписокКолонокГрафика();
	
	Для Каждого ТекСтрокаГрафика из График Цикл
		
		Для Каждого ТекКолонка Из СписокКолонок Цикл
			
			Если ТекСтрокаГрафика[ТекКолонка.Представление] <> 0 Тогда
				ДобавитьСтрокуГрафикаЛинейного(ГрафикЛинейный, ТекСтрокаГрафика.Дата, ТекКолонка.Значение, ТекСтрокаГрафика[ТекКолонка.Представление]);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если (ВидФормы = "ФормаОбъекта") И Параметры.Свойство("Ключ") Тогда
		
		СтандартнаяОбработка = Ложь;
		ВыбраннаяФорма = "Справочник.ЦенныеБумаги.ФормаОбъекта";
		Параметры.Вставить("ВерсияСсылка", Параметры.Ключ);
		Параметры.Вставить("Ключ", ОбщегоНазначенияУХ.ПолучитьЗначениеРеквизита(Параметры.ВерсияСсылка, "ФинансовыйИнструмент"));
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьСписокКолонокГрафика()
	
	Результат = Новый СписокЗначений;
	
	Результат.Добавить(Перечисления.КолонкиГрафика.ОсновнойДолгПоступление, "ОсновнойДолгПолучение");
	Результат.Добавить(Перечисления.КолонкиГрафика.ОсновнойДолгСписание, "ОсновнойДолгВозврат");
	Результат.Добавить(Перечисления.КолонкиГрафика.ПроцентыКупоныНачисление, "ПроцентыНачислено");
	Результат.Добавить(Перечисления.КолонкиГрафика.ПроцентыКупоныСписание, "ПроцентыУплачено");
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьСтрокуГрафикаЛинейного(ГрафикЛинейный, ДатаОперации, КолонкаГрафика, Сумма)
	
	НоваяСтрокаГрафика = ГрафикЛинейный.Добавить();
	НоваяСтрокаГрафика.ДатаОперации = ДатаОперации;
	НоваяСтрокаГрафика.КолонкаГрафика = КолонкаГрафика;
	НоваяСтрокаГрафика.Сумма = Сумма;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиОбновленияВерсииИнформационнойБазы

Процедура ЗаполнитьЛинейныеГрафики() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 

	"
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВерсияГрафикаЦеннойБумагиГрафик.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ВерсияГрафикаЦеннойБумаги.График КАК ВерсияГрафикаЦеннойБумагиГрафик
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВерсияГрафикаЦеннойБумаги.ГрафикНоминалаЛинейный КАК ВерсияГрафикаЦеннойБумагиГрафикНоминалаЛинейный
	|		ПО ВерсияГрафикаЦеннойБумагиГрафик.Ссылка = ВерсияГрафикаЦеннойБумагиГрафикНоминалаЛинейный.Ссылка
	|ГДЕ
	|	ВерсияГрафикаЦеннойБумагиГрафикНоминалаЛинейный.Ссылка ЕСТЬ NULL
	|";

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Документы.ВерсияГрафикаЦеннойБумаги.ЗаполнитьГрафикЛинейный(ДокОбъект.График, ДокОбъект.ГрафикНоминалаЛинейный);
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокОбъект);
		
	КонецЦикла

КонецПроцедуры

#КонецОбласти

#КонецЕсли
